jet_in_flow/icoFoamColored_laminar_nonmixing/U1_0_1_U2_0_6/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile { format ascii; class volVectorField; object U; }
dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (0 0 0);

boundaryField
{
    inletMain   { type fixedValue; value uniform (0.1 0 0); }   // left→right
    outlet      { type zeroGradient; }

    jetInlet    { type fixedValue; value uniform (0 0 0.6); }    // upward jet (+y)

    top         { type noSlip; }
    floor       { type noSlip; }
    sideWalls   { type noSlip; }
    ductWalls   { type noSlip; }
}

// ************************************************************************* //
