jet_in_flow/icoFoamColored_laminar_nonmixing/U1_0_1_U2_0_6/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
|  fvSchemes for icoFoamColored (laminar, two tracers cA/cB)                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}

ddtSchemes
{
    // zeitdiskretisierung
    default         backward;      // stabil, 2. Ordnung in der Zeit
    // alternativ: Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    // Impulsgleichung
    div(phi,U)      Gauss linearUpwind grad(U);

    // Tracer-Transport
    div(phi,cA)     Gauss upwind;
    div(phi,cB)     Gauss upwind;
}

laplacianSchemes
{
    // Viskosität und Tracer-Diffusion
    default         Gauss linear corrected;

    laplacian(nu,U) Gauss linear corrected;
    laplacian(D,cA) Gauss linear corrected;
    laplacian(D,cB) Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

